app/Controllers/Employee.php

    public function index(){

        $apiKey = $this->request->getHeaderLine('X-API-Key');
        // echo 'Received API Key: ' . $apiKey;
        // echo 'Expected API Key: ' . ApiConfig::$apiKey;
        if (!in_array($apiKey, ApiConfig::$apiKey)) {
            return $this->failNotFound('Invalid API key');
        }

        $model = new EmployeeModel();
        $data['employees'] = $model->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `employees`
ORDER BY `id` ASC

    public function show($id = null){
        $model = new EmployeeModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `employees`
WHERE `id` = '14'
 LIMIT 1