app/Controllers/SignupController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('tasha', 'tasha@gmail.com', '$2y$10$yeLJ1qJ8ySqpWP5/9NKUdeA3SIQFrDAVhCql4QDUeg06HFos.2I82')
---
            $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);
            unset($data['confirmpassword']);

            $userModel->save($data);