app/Controllers/SigninController.php

    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();
        $name = $this->request->getVar('name');
        $password = $this->request->getVar('password');

        $data = $userModel->where('name', $name)->first();
---
SELECT *
FROM `users`
WHERE `name` = 'emma'
 LIMIT 1